Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: A very common need is to start some services on which your Quarkus application depends, before the Quarkus application starts for testing. To address this need, Quarkus provides `@io.quarkus.test.common.QuarkusTestResource` and `io.quarkus.test.common.QuarkusTestResourceLifecycleManager`.
zh_cn: 一个很常见的需求是在Quarkus应用程序启动测试之前，启动一些您的Quarkus应用程序所依赖的服务。为了解决这个需求，Quarkus提供了 `@io.quarkus.test.common.QuarkusTestResource` 和 `io.quarkus.test.common.QuarkusTestResourceLifecycleManager` 。

source: A virtual (and in person where possible) tour of Java User Groups creating a unique hands-on experience with access to Quarkus experts designed to help you get started with Java in a Kubernetes world.
zh_cn: 一个Java用户组的虚拟之旅(如果可能的话还可以亲自去)，创建一个独特的亲身体验，造访旨在帮助您在Kubernetes世界中开始使用Java的Quarkus专家。

source: A working container runtime (Docker or Podman)
zh_cn: 可以工作的容器 (Docker或者Podman)

source: A working container runtime (Docker, podman)
zh_cn: 一个工作的容器运行时（Docker 或 podman）

source: A xref:configuring-c-development[working C development environment]
zh_cn: 一个 xref:configuring-c-development[C语言工作开发环境]

source: AMQP Body Type
zh_cn: AMQP主体类型

source: AMQP Client
zh_cn: AMQP客户端

source: AMQP Connector Configuration Reference
zh_cn: AMQP连接器配置参考

source: AMQP Data (with binary content) and the `content-type` is set to `application/json`
zh_cn: AMQP数据（有二进制内容），并且 `content-type` 被设为 `application/json`

source: AMQP Data using a binary content. No `content-type` set
zh_cn: 使用二进制内容的AMQP数据。没有设置 `content-type`

source: AMQP Data using a binary content. The `content-type` is set to `application/json`
zh_cn: 使用二进制内容的AMQP数据。 `content-type` 被设置为 `application/json`

source: AMQP Data with a different `content-type`
zh_cn: 带有不同 `content-type` 的AMQP数据

source: AMQP Message Body
zh_cn: AMQP消息主体

source: AMQP Sequence
zh_cn: AMQP 序列

source: AMQP Value containing a http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-types-v1.0-os.html#section-primitive-type-definitions[AMQP Primitive Type]
zh_cn: 包含 link:http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-types-v1.0-os.html#section-primitive-type-definitions[AMQP原始类型] 的AMQP值

source: AMQP Value using the `Binary` type
zh_cn: 使用 `Binary` 类型的AMQP值

source: AMQP Value using the corresponding AMQP Type
zh_cn: 使用相应的AMQP类型的AMQP值

source: AMQP Value with the payload
zh_cn: 带有有效载荷的AMQP值

source: AMQP connector extension
zh_cn: AMQP连接器扩展

source: API Gateway supports many ways to securely invoke on your HTTP endpoints that are backed by Lambda and Quarkus. If you enable it, Quarkus will automatically parse relevant parts of the https://docs.aws.amazon.com/apigateway/latest/developerguide/http-api-develop-integrations-lambda.html[event json document] and look for security based metadata and register a `java.security.Principal` internally that can be looked up in JAX-RS by injecting a `javax.ws.rs.core.SecurityContext`, via `HttpServletRequest.getUserPrincipal()` in servlet, and `RouteContext.user()` in Reactive Routes. If you want more security information, the `Principal` object can be typecast to a class that will give you more information.
zh_cn: API Gateway支持许多不同的方式来对你的HTTP端点进行安全调用，这些端点是由Lambda和Quarkus支持的。如果你启用了它，Quarkus会自动解析 link:https://docs.aws.amazon.com/apigateway/latest/developerguide/http-api-develop-integrations-lambda.html[事件json文档] 的相关部分，查找基于安全的元数据，并在内部注册一个 `java.security.Principal` ，通过注入 `javax.ws.rs.core.SecurityContext` ，通过Servlet中的 `HttpServletRequest.getUserPrincipal()` ，以及Reactive Routes中的 `RouteContext.user()` ，可以在JAX-RS中进行查找。如果你了解更多的安全信息， `Principal` 对象可以被类型转化为一个能给你更多信息的类。

source: AWS X-Ray does add many classes to your distribution, do ensure you are using at least the 256MB AWS Lambda memory size. This is explicitly set in `manage.sh` `cmd_create()`. Whilst the native image potentially can always use a lower memory setting, it would be recommended to keep the setting the same, especially to help compare performance.
zh_cn: AWS X-Ray确实在你的发行版中添加了许多类，确保你至少使用了256MB的AWS Lambda内存大小。这在 `manage.sh` `cmd_create()` 中进行了明确的设置。虽然原生镜像可能总是使用较低的内存设置，但建议保持设置不变，特别是为了帮助比较性能。

source: About serialization
zh_cn: 关于序列化

source: Accept JWT as a cookie
zh_cn: 接受JWT作为cookie

source: Access Git repositories with JGit
zh_cn: 用JGit访问Git存储库

source: Access to Public Resources
zh_cn: 获取公共资源

source: Accessing JWT claims
zh_cn: 访问JWT声明

source: Accessing Kafka clients directly
zh_cn: 直接访问Kafka客户端

source: Accessing application properties with Spring Boot properties API
zh_cn: 使用Spring Boot属性API访问应用程序属性

source: Accessing the Vert.x instance
zh_cn: 访问Vert.x实例

source: Accessing the managed Vert.x instance
zh_cn: 访问被管理的Vert.x实例

source: Acknowledgement
zh_cn: 消息确认

source: Acknowledgment Strategies
zh_cn: 确认策略(Acknowledgment Strategies)

source: Add `quarkus-jaxb` as a dependency in your Maven `pom.xml`, or Gradle `build.gradle` file.
zh_cn: 把 `quarkus-jaxb` 作为一个依赖项添加到你的Maven `pom.xml` ，或Gradle `build.gradle` 文件中。

source: Add `quarkus.kafka.snappy.enabled=true` to your `application.properties`
zh_cn: 将 `quarkus.kafka.snappy.enabled=true` 添加到您的 `application.properties` 中

source: Add a SQL migration to the default folder following the Flyway naming conventions: `{migrations-path}/V1.0.0__Quarkus.sql`
zh_cn: 按照Flyway的命名惯例，在默认文件夹中添加SQL迁移： `{migrations-path}/V1.0.0__Quarkus.sql`

source: Add an optional `name` property to the `GreetingProperties`:
zh_cn: 在 `GreetingProperties` 中添加一个可选的 `name` 属性:

source: Add custom queries on your entities inside the entities themselves. That way, you and your co-workers can find them easily, and queries are co-located with the object they operate on. Adding them as static methods in your entity class is the Panache Active Record way.
zh_cn: 在实体本身内部的实体上添加自定义查询。这样，您和您的同事可以轻松找到它们，并且查询与他们操作的对象位于同一位置。将它们作为静态方法添加到实体类中是 Panache Active Record 方式。

source: Add the following dependencies to your test project:
zh_cn: 在你的测试项目中添加以下依赖项：

source: Add the following dependency:
zh_cn: 添加以下依赖关系：

source: Add the following method to the `VertxResource` class:
zh_cn: 将以下方法添加到 `VertxResource` 类中:

source: Add this dependency to your `pom.xml`:
zh_cn: 将此依赖添加到你的 `pom.xml` 中 ：

source: Add this dependency to your build file:
zh_cn: 将以下依赖性添加到你的构建文件中：

source: Add this dependency:
zh_cn: 添加这个依赖性：

source: Adding a Public Key
zh_cn: 添加公钥

source: Adding a `%prod.` profile prefix to `quarkus.oidc.auth-server-url` ensures that `Dev Services for Keycloak` will launch a container for you when the application is run in a dev mode. See <<keycloak-dev-mode, Running the Application in Dev mode>> section below for more information.
zh_cn: 在 `quarkus.oidc.auth-server-url` 上添加一个 `%prod.` profile前缀，可以确保 `Keycloak开发服务` 在应用程序以开发模式运行时为您启动一个容器。更多信息请参见下面的 " link:#keycloak-dev-mode[在开发模式下运行应用程序] "部分。

source: Adding entity methods
zh_cn: 添加实体方法

source: Additional Quarkus resources for OIDC authentication
zh_cn: 用于OIDC认证的其他Quarkus资源

source: Additional SmallRye JWT configuration
zh_cn: 额外的SmallRye JWT配置

source: Additional configuration
zh_cn: 其他配置

source: Additional instrumentation
zh_cn: 其他的植入(instrumentation)

source: Additional requirements for client SSL
zh_cn: 对客户端SSL的额外要求

source: Additional set `-Djavax.net.ssl.trustStorePassword=changeit` if your `cacerts` file is password protected.
zh_cn: 如果你的 `cacerts` 文件有密码保护，则额外设置 `-Djavax.net.ssl.trustStorePassword=changeit` 。

source: Additionally, Quarkus includes extensions that make it easy to deploy serverless microservices to cloud providers including AWS Lambda, Azure Functions, and Google Cloud Functions as well as Knative to take advantage of Quarkus application’s fast startup times. <a href="{{site.baseurl}}/guides/deploying-to-kubernetes">Read the guide for more details.</a>
zh_cn: 此外，Quarkus还包括一些扩展，使其能够轻松地将无服务器微服务部署到云提供商，包括AWS Lambda、Azure Functions和Google Cloud Functions以及Knative，以获得Quarkus应用程序的快速启动时间方面优势。<a href="{{site.baseurl}}/guides/deploying-to-kubernetes">阅读该指南以了解更多细节</a>

source: Additionally, `quarkus-oidc` provides a simple default memory based token cache which implements both `quarkus.oidc.TokenIntrospectionCache` and `quarkus.oidc.UserInfoCache` interfaces.
zh_cn: 此外， `quarkus-oidc` 提供了一个简单的基于内存的默认令牌缓存，该缓存同时实现了 `quarkus.oidc.TokenIntrospectionCache` 和 `quarkus.oidc.UserInfoCache` 接口。

source: Additionally, a custom `SecurityIdentityAugmentor` can also be used to add the roles as documented xref:security.adoc#security-identity-customization[here].
zh_cn: 此外，一个自定义的 `SecurityIdentityAugmentor` ，也可以用来添加角色，文档请查阅 link:security.html#security-identity-customization[这里] 。

source: Advanced Query
zh_cn: 高级查询

source: Advanced configuration of the transaction is possible with the use of the `@TransactionConfiguration` annotation that is set in addition to the standard `@Transactional` annotation on your entry method or at the class level.
zh_cn: 除了在你的入口方法上或在类的层面上设置标准的 `@Transactional` 注解之外，事务的高级配置还可以通过使用 `@TransactionConfiguration` 注解来实现。

source: After compilation has finished, you find the build artifact in `target/native-sources`:
zh_cn: 编译完成后，你可以在 `target/native-sources` 找到构建工件：

source: After getting a cup of coffee, you'll be able to run this binary directly:
zh_cn: 一杯咖啡的时间后，您就可以直接运行该二进制文件了：

source: After importing the realm you can see the resource permissions:
zh_cn: 导入realm后，您可以看到资源的权限：

source: After you make this addition to your `TokenSecuredResource`, rerun the `./mvnw compile quarkus:dev` command, and then try `curl -v http://127.0.0.1:8080/secured/roles-allowed; echo` to attempt to access the new endpoint. Your output should be:
zh_cn: 在对你的 `TokenSecuredResource` 进行这一补充后，重新运行 `./mvnw compile quarkus:dev` 命令，然后尝试 `curl -v http://127.0.0.1:8080/secured/roles-allowed; echo` 来访问新的端点。你的输出应该是:

source: After you run the build, there are a few extra files generated by the Quarkus lambda extension you are using. These files are in the build directory: `target/` for Maven, `build/` for Gradle.
zh_cn: 运行构建后，你所使用的Quarkus lambda扩展会生成一些额外的文件。对于Maven，这些文件位于构建目录： `target/` 中，对于Gradle，则位于 `build/` 中。

source: After you run the build, there are a few extra files generated by the `quarkus-amazon-lambda` extension. These files are in the the build directory: `target/` for maven, `build/` for gradle.
zh_cn: 运行构建后，有几个由 `quarkus-amazon-lambda` 扩展额外生成的文件。对于maven，这些文件位于构建目录：`target/` 中，对于gradle，则位于 `build/` 中。

source: All BuildItems
zh_cn: 所有BuildItems

source: All Configuration Properties
zh_cn: 所有配置属性

source: All `list` methods have equivalent `stream` versions.
zh_cn: 所有 `list` 方法都有与之对应的 `stream` 版本。

source: All configuration options
zh_cn: 所有配置选项

source: All messages received by a consumer must be acknowledged. In the absence of acknowledgment, the processing is considered in error. If the consumer method receives a `Record` or a payload, the message will be acked on method return, also known as `Strategy.POST_PROCESSING`. If the consumer method returns another reactive stream or `CompletionStage`, the message will be acked when the downstream message is acked. You can override the default behavior to ack the message on arrival (`Strategy.PRE_PROCESSING`), or do not ack the message at all (`Strategy.NONE`) on the consumer method as in the following example:
zh_cn: 消费者收到的所有消息都必须被确认(acknowleged)。在没有确认的情况下，消息处理会出错。如果消费者方法收到一个 `Record` 或一个payload，该消息将通过方法返回被确认，也被称为 `Strategy.POST_PROCESSING` 。如果消费者方法返回另一个reactive stream或 `CompletionStage` ，那么当下游消息(downstream message)被确认时，该消息也将被确认。您可以覆盖默认行为从而在消息到达时进行确认( `Strategy.PRE_PROCESSING` )，或者在消费者方法中不进行任何确认( `Strategy.NONE` )，如下例所示：

source: All methods accepting a query string also accept an optional `Sort` parameter, which allows you to abstract your sorting:
zh_cn: 所有接受查询字符串的方法也接受一个可选的 `Sort` 参数，这使你可以抽象出你的排序：

source: All methods accepting a query string also accept the following simplified query form:
zh_cn: 所有接收查询字符串的方法也能接收以下简化形式的查询：

source: All opaque and sometimes JWT Bearer access tokens have to be remotely introspected. If `UserInfo` is also required then the same access token will be used to do a remote call to OpenID Connect Provider again. So, if `UserInfo` is required and the current access token is opaque then for every such token there will be 2 remote calls done - one to introspect it and one to get UserInfo with it, and if the token is JWT then usually only a single remote call will be needed - to get UserInfo with it.
zh_cn: 所有不透明的、有时是JWT不记名的访问令牌都必须进行远程自省。如果还需要 `UserInfo` ，那么相同的访问令牌将被用来再次远程调用OpenID Connect Provider。因此，如果需要 `UserInfo` ，并且当前的访问令牌是不透明的，那么对于每一个这样的令牌，将进行两次远程调用--一次是反省，一次是用它来获取UserInfo，如果令牌是JWT，那么通常只需要一次远程调用--用它来获取UserInfo。

source: All right, so far so good, but wouldn't it be better with a few tests, just in case.
zh_cn: 好吧，到目前为止还不错。为了以防万一， 我们需要再做一些测试。

source: All spans created from the application will include an OpenTelemetry `Resource` indicating the span was created by the `myservice` application. If not set, it will default to the artifact id.
zh_cn: 所有从应用程序创建的spans将包含一个OpenTelemetry `Resource` ，表明该span是由 `myservice` 应用程序创建。如果没有设置，它将默认为artifact id。

source: All the JWT claims can also be injected. Let's expand our `TokenSecuredResource` with another endpoint /secured/roles-allowed-admin which uses the injected `birthdate` claim (as opposed to getting it from `JsonWebToken`):
zh_cn: 所有的JWT声明(claims)也可以被注入。让我们用另一个端点/secured/roles-allowed-admin来扩展我们的 `TokenSecuredResource` ，它使用注入的 `birthdate` （而不是从 `JsonWebToken` 得来）：

source: All the information between the browser and the server are formatted as JSON.
zh_cn: 浏览器和服务器之间的所有信息都被格式化为JSON。

source: All the information between the browser and the server is formatted as JSON.
zh_cn: 浏览器和服务器之间的所有信息都被格式化为JSON。

source: All the operations that are defined on `PanacheEntityBase` are available on your repository, so using it is exactly the same as using the active record pattern, except you need to inject it:
zh_cn: `PanacheEntityBase` 中定义的所有方法都可以在你的Repository类上使用，所以它使用起来与Active Record模式完全一样，只是你需要注入Repository类的实例：

source: All the operations that are defined on `PanacheMongoEntityBase` are available on your repository, so using it is exactly the same as using the active record pattern, except you need to inject it:
zh_cn: 所有在 `PanacheMongoEntityBase` 上定义的操作都可以在你的版本库上使用，所以使用它与使用active record（活动记录）模式完全一样，只是你需要注入它。

source: All the techniques allowing reducing the memory usage and provide faster startup times are not only advantageous in containers. Even on bare metal, it would reduce your memory pressure, and it’s always pleasant to not have to wait 10 seconds to see your application running.
zh_cn: 所有允许减少内存使用和提供更快的启动时间的技术，不仅在容器中是有利的。即使在裸金属环境上，它也会减少你的内存压力，而且不必等待10秒就能看到你的应用程序运行，这总是令人愉快的。

source: All the test profile configuration is stored in a single class, which makes it easy to tell if the previous test ran with the same configuration.
zh_cn: 所有的测试profile配置都存储在一个单一的类中，这使得我们很容易知道之前的测试是否以相同的配置运行。

source: All these delivery mechanisms are non-blocking and are providing one of the fundamental bricks to build reactive applications.
zh_cn: 所有这些交付机制都是无阻塞的，并提供了构建响应式应用的基本砖块之一。

source: All these methods have default implementations so just override the ones you need to override.
zh_cn: 所有这些方法都有默认的实现，所以只要覆盖您需要覆盖的方法就可以。

source: Also, Quarkus makes it very easy to configure various Jackson settings via CDI beans. The simplest (and suggested) approach is to define a CDI bean of type `io.quarkus.jackson.ObjectMapperCustomizer` inside of which any Jackson configuration can be applied.
zh_cn: 另外，Quarkus使得通过CDI beans来配置各种Jackson设置变得非常容易。最简单的（也是建议的）方法是定义一个类型为 `io.quarkus.jackson.ObjectMapperCustomizer` 的CDI Bean，在其中可以使用任何Jackson配置。

source: Also, at least in the generated Maven archetype `pom.xml`, the `quarkus-resteasy-reactive`, `quarkus-reactive-routes`, and `quarkus-undertow` dependencies are all optional. Pick which HTTP framework(s) you want to use (JAX-RS, Reactive Routes, and/or Servlet) and remove the other dependencies to shrink your deployment.
zh_cn: 另外，至少在生成的Maven原型 `pom.xml` 中， `quarkus-resteasy-reactive` 、 `quarkus-reactive-routes` 和 `quarkus-undertow` 依赖项都是可选的。选择你想使用的HTTP框架（JAX-RS、Reactive Routes和/或Servlet），并删除其他依赖项以缩小部署规模。

source: Also, you can configure the lookup timeout using:
zh_cn: 此外，您可以使用以下方法配置来查找超时：

source: Altering the test class
zh_cn: 改动测试类

source: Alternative - Using ubi-minimal
zh_cn: 替代方案 - 使用 ubi-minimal

source: Alternative Languages
zh_cn: 替代语言

source: Alternatively or additionally to an interceptor, you can enrich *all* your `@QuarkusTest` classes by implementing the following callback interfaces:
zh_cn: 作为拦截器的替代或补充，您可以通过实现以下回调接口来增强 *所有* 的 `@QuarkusTest` 类：

source: Alternatively, if the discovery endpoint is not available, or if you would like to save on the discovery endpoint round-trip, you can disable the discovery and configure them with relative path values, for example:
zh_cn: 另外，如果发现端点不可用，或者你想节省发现端点的往返开销，你可以禁用发现，用相对路径值配置它们，比如说：

source: Alternatively, prefer the use of constructor injection which works without modification of the Java examples, increases testability and complies best to a Kotlin programming style.
zh_cn: 或者，更喜欢使用构造函数注入，它可以在不修改Java示例的情况下工作，提高可测试性，并且最符合Kotlin编程风格。

source: Alternatively, you can start a Kafka broker in a test resource. The following snippet shows a test resource starting a Kafka broker using https://www.testcontainers.org/modules/kafka/[Testcontainers]:
zh_cn: 另外，您也可以在测试资源中启动一个Kafka broker。下面的片段展示了如何在一个测试资源使用 link:https://www.testcontainers.org/modules/kafka/[Testcontainers] 启动一个Kafka broker：

source: Alternatively, you can use the `blocking` attribute from the `@ConsumeEvent` annotation:
zh_cn: 或者，你可以使用 `@ConsumeEvent` 注解中的 `blocking` 属性。

source: Alternatively, your application can inject a `Multi` in your bean and subscribe to its events as the following example:
zh_cn: 另外，您的应用程序可以在您的Bean中注入一个 `Multi` ，然后像下面的例子那样订阅它的事件：

source: Although the test above is good for showing the capabilities of `@InjectMock`, it is not a good representation of a real test. In a real test we would most likely configure a mock, but then test a bean that uses the mocked bean. Here is an example:
zh_cn: 尽管上面的测试很好地展示了 `@InjectMock` 的能力，但它并不能很好地表示一个真实的测试案例。在一个真实的测试案例中，我们很可能会配置一个mock，然后测试一个使用了mocked Bean的Bean。下面是一个例子：

source: Although, there is a slight limitation: since job configuration is mostly dynamic and only injected on job execution, Quarkus may fail to start due to invalid configuration (can’t find the Job configuration values). In this case, configuration injection points with the @ConfigProperty annotation need to set a default value or use an Optional.
zh_cn: 虽然，有一个小小的限制：由于作业配置大多是动态的，并且只在作业执行时注入，Quarkus可能会因为无效的配置（找不到作业配置值）而启动失败。在这种情况下，带有@ConfigProperty注解的配置注入点需要设置一个默认值或使用一个Optional。

source: Amazon Alexa Integration
zh_cn: 亚马逊Alexa整合

source: Amazon Lambda with RESTEasy Reactive, Undertow, or Reactive Routes
zh_cn: 带有RESTEasy Reactive、Undertow或Reactive Routes的Amazon Lambda

source: Amazon Lambda with Vert.x Web, Servlet, or RESTEasy
zh_cn: 带有Vert.x Web、Servlet或RESTEasy的Amazon Lambda

source: An IDE
zh_cn: 编辑器

source: An Open Project
zh_cn: 一个开放的项目

source: An additional step is needed for generating the private key for converting it into the PKCS#8 format.
zh_cn: 生成私钥后需要一个额外的步骤，以便将其转换为PKCS#8格式。

source: An even nastier possible outcome could be for no exception to be thrown, but instead the JSON result would be completely empty.
zh_cn: 一个更糟糕的结果是没有抛出异常，而JSON的结果是完全空的。

source: An example configuration follows:
zh_cn: 下面是一个配置实例：

source: An example explaining how to deploy verticles during the initialization of the application will follow.
zh_cn: 接下来会有一个例子解释如何在应用程序的初始化过程中部署verticles：

source: An example of a `Person` class defined as a Kotlin data class would look like:
zh_cn: 一个定义为Kotlin数据类的 `Person` 类的例子是这样的：

source: An example usage can be found in <<chaining-kafka-transactions-with-hibernate-reactive-transactions>>.
zh_cn: 示例用法可以在 <<chaining-kafka-transactions-with-hibernate-reactive-transactions>> 中找到。

source: An example usage could look like:
zh_cn: 示例用法如下所示：

source: An example use of this could be the following Maven command, that forces `@QuarkusIntegrationTest` to execute against that is accessible at `http://1.2.3.4:4321`:
zh_cn: 这方面的一个例子是下面的Maven命令，该命令强制 `@QuarkusIntegrationTest` 对位于 `link:http://1.2.3.4:4321[http://1.2.3.4:4321]` 节点执行测试 :

source: An example where a custom module needs to be registered would look like so:
zh_cn: 需要注册自定义模块的示例如下所示：

source: And all this functionality is provided in a distributed, highly scalable, elastic, fault-tolerant, and secure manner.
zh_cn: 而所有这些功能都是以分布式、高可扩展性、弹性、容错以及安全的方式提供的。

source: And configure the Maven Surefire plugin as follows:
zh_cn: 并按以下方式配置Maven Surefire插件：

source: And executed using `java -jar target/quarkus-app/quarkus-run.jar`.
zh_cn: 并使用 `java -jar target/quarkus-app/quarkus-run.jar` 命令运行该应用程序。

source: And executed using `java -jar target/quarkus-app/quarkus-run.jar`:
zh_cn: 执行程序使用 `java -jar target/quarkus-app/quarkus-run.jar` ：

source: And finally, run it with:
zh_cn: 最后，用以下方式运行：

source: And thanks to our field access rewrite, when your users read `person.name` they will actually call your `getName()` accessor, and similarly for field writes and the setter. This allows for proper encapsulation at runtime as all fields calls will be replaced by the corresponding getter/setter calls.
zh_cn: 而且由于我们的字段访问重写，当你的用户读取 `person.name` ，他们实际上会调用你的 `getName()` 方法，类似的还有字段写入和设置器。这允许在运行时进行适当的封装，因为所有字段的调用都将被相应的getter/setter调用所取代。

source: And this repository:
zh_cn: 还有这个储存库：

source: And update the `GreetingResource` and its test `GreetingResourceTest`:
zh_cn: 并更新 `GreetingResource` 及其对应的 `GreetingResourceTest` :

source: And we want to use it to receive messages from Kafka, make some price transformation, and send messages back to Kafka.
zh_cn: 而我们想用它来接收来自Kafka的消息，从而进行一些价格转换，并将消息传回Kafka。

source: And, finally, run it with:
zh_cn: 最后，用以下方式运行：

source: And, in a separate terminal:
zh_cn: 并且，在另一台终端中：

source: Annotating a method in any CDI aware bean with the `io.opentelemetry.extension.annotations.WithSpan` annotation will create a new Span and establish any required relationships with the current Trace context.
zh_cn: 在任何CDI可感知的Bean中用 `io.opentelemetry.extension.annotations.WithSpan` 注解来注释一个方法将会创建一个新的Span，并与当前Trace上下文建立所需要的任何关系。

source: Annotating with `@MongoEntity` is optional. Here the entity will be stored in the `ThePerson` collection instead of the default `Person` collection.
zh_cn: `@MongoEntity` 注解是可选的。在这里，实体将被存储在 `ThePerson` 集合中，而不是默认的 `Person` 集合。

source: Annotation-based test resources
zh_cn: 基于注解的测试资源

source: Another bean receives this message and computes the response
zh_cn: 另一个Bean收到这个消息，并计算出响应

source: Another common pattern in the JAX-RS world is to use the `Response` object. `Response` comes with some nice perks:
zh_cn: JAX-RS世界中另一个常见的模式是使用 `Response` 对象。 `Response` 有一些很好的好处：

source: Another option is to use the `@BsonCreator` annotation to tell the `PojoCodecProvider` to use the Kotlin data class default constructor, in this case all constructor parameters have to be annotated with `@BsonProperty`: see link:{mongodb-doc-root-url}/bson/pojos/#supporting-pojos-without-no-args-constructors[Supporting pojos without no args constructor].
zh_cn: 另一个选择是使用 `@BsonCreator` 注解来告诉 `PojoCodecProvider` 使用Kotlin数据类的默认构造函数，在这种情况下，所有的构造函数参数都必须用 `@BsonProperty` 注解：见 link:{mongodb-doc-root-url}/bson/pojos/#supporting-pojos-without-no-args-constructors[支持pojos无args构造函数] 。

source: Another possibility is to include the `quarkus.native.additional-build-args` configuration property in your `application.properties`.
zh_cn: 另一种做法是在你的 `application.properties` ，填写 `quarkus.native.additional-build-args` 配置属性。

source: Another solution is to write a script to do this for you:
zh_cn: 另一个解决方案是写一个脚本来完成：
